export const stages = [
  {
    id: 1,
    title: 'Сбор информации и аналитика',
    description: 'Обговариваем ключевые детали проекта, анализируем рынок, исследуем конкурентов, обсуждаем стратегию.'
  },
  {
    id: 2,
    title: 'Техническое задание',
    description: 'Пишем подробное ТЗ: функции, архитектура, взаимодействие с сервером, схема экранов.'
  },
  {
    id: 3,
    title: 'Прототип приложения',
    description: 'Создаем интерактивный макет будущего приложения без финального дизайна.'
  },
  {
    id: 4,
    title: 'UX/UI дизайн интерфейса',
    description: 'Разрабатываем макеты экранов с учетом UX/UI и требований App Store и Google Play.'
  },
  {
    id: 5,
    title: 'Разработка ПО',
    description: 'Пишем код двухнедельными спринтами, прорабатываем анимации и юзабилити.'
  },
  {
    id: 6,
    title: 'Тестирование',
    description: 'Проверяем работу приложения в разных сценариях и на разных устройствах.'
  },
  {
    id: 7,
    title: 'Публикация',
    description: 'Готовим аккаунты в сторах, графику и отправляем продукт на модерацию.'
  },
  {
    id: 8,
    title: 'Продвижение приложения',
    description: 'Запускаем маркетинг и рекламу, оптимизируем страницы приложения в сторах, привлекаем пользователей.'
  }
]; 